<a href="https://colab.research.google.com/github/VAEH/curso-python/blob/master/4_datatypes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
!pip install --upgrade pandas

Collecting pandas
  Downloading https://files.pythonhosted.org/packages/51/51/48f3fc47c4e2144da2806dfb6629c4dd1fa3d5a143f9652b141e979a8ca9/pandas-1.2.4-cp37-cp37m-manylinux1_x86_64.whl (9.9MB)
     |████████████████████████████████| 9.9MB 8.5MB/s
Requirement already satisfied, skipping upgrade: numpy>=1.16.5 in /usr/local/lib/python3.7/dist-packages (from pandas) (1.19.5)
Requirement already satisfied, skipping upgrade: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2.8.1)
Requirement already satisfied, skipping upgrade: pytz>=2017.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2018.9)
Requirement already satisfied, skipping upgrade: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
ERROR: google-colab 1.0.0 has requirement pandas~=1.1.0; python_version >= "3.0", but you'll have pandas 1.2.4 which is incompatible.
Installing collected packages: pandas
  Found existing installation: pandas 1.1.5
    Uninstalling pandas-1.1.5:
      Successfully uninstalled pandas-1.1.5
Successfully installed pandas-1.2.4

In [1]:
from google.colab import drive
drive.mount('/content/drive/')

Drive already mounted at /content/drive/; to attempt to forcibly remount, call drive.mount("/content/drive/", force_remount=True).

In [2]:
#Redirigimos nuestro código
%cd '/content/drive/My Drive/Colab Notebooks/db'
!ls

/content/drive/My Drive/Colab Notebooks/db
Meteorite_Landings.csv	test.h5    test.parquet  test.xlsx
test.csv		test.json  test.pkl

In [3]:
import pandas as pd
pd.__version__

'1.2.4'

Leemos el archivo de CSV

In [4]:
df_meteorites = pd.read_csv('Meteorite_Landings.csv')

- Si son bastantes nuestros datos, podemos ver los 5 primeros datos con el comando `.head()`, si quiero ver más coloco el número dentro del parentesis y me muestra ese monton. 

- Con `.tail()` puede ver los últimos registros de mi DataFrame

In [5]:
df_meteorites.tail(10)

             name     id nametype  ...    reclat    reclong             GeoLocation
45706     Zerkaly  31354    Valid  ...  52.13333   81.96667    (52.13333, 81.96667)
45707    Zhaoping  54609    Valid  ...  24.23333  111.18333   (24.23333, 111.18333)
45708    Zhigansk  30405    Valid  ...  68.00000  128.30000           (68.0, 128.3)
45709  Zhongxiang  30406    Valid  ...  31.20000  112.50000           (31.2, 112.5)
45710  Zillah 001  31355    Valid  ...  29.03700   17.01850       (29.037, 17.0185)
45711  Zillah 002  31356    Valid  ...  29.03700   17.01850       (29.037, 17.0185)
45712      Zinder  30409    Valid  ...  13.78333    8.96667     (13.78333, 8.96667)
45713        Zlin  30410    Valid  ...  49.25000   17.66667       (49.25, 17.66667)
45714   Zubkovsky  31357    Valid  ...  49.78917   41.50460     (49.78917, 41.5046)
45715  Zulu Queen  30414    Valid  ...  33.98333 -115.68333  (33.98333, -115.68333)

[10 rows x 10 columns]

 - Con `sample()` puede ver un cierto número de registros de forma aleatoria

In [6]:
df_meteorites.sample(10)

                              name     id  ...    reclong             GeoLocation
40929                Yamato 791733  27082  ...   35.66667       (-71.5, 35.66667)
8738          Dominion Range 08294  54072  ...    0.00000              (0.0, 0.0)
1638             Allan Hills 03541  35731  ...        NaN                     NaN
5860              Dar al Gani 1042  44710  ...   16.30017      (27.182, 16.30017)
26782        Northwest Africa 1567  17326  ...        NaN                     NaN
37431                        Selma  23486  ...  -87.00000           (32.4, -87.0)
10097       Elephant Moraine 90084   8493  ...  156.43003  (-76.28144, 156.43003)
32648  Queen Alexandra Range 93394  19482  ...  168.00000          (-84.0, 168.0)
7049                   Dhofar 1049   6853  ...   54.70170     (18.92632, 54.7017)
28407        Northwest Africa 4164  34436  ...        NaN                     NaN

[10 rows x 10 columns]

- Con el comando `.shape` podemos ver el tamaño de nuestra base de datos

In [7]:
df_meteorites.shape

(45716, 10)

- Con `.size` podemos ver la cántidad de datos que tenemos. filas x columnas

In [8]:
df_meteorites.size

457160

- Con `.describe()` me dice variables de mis datos, pero de forma estadistica. 

    Si ordenamos los datos de menor a mayor, al cortar la base en el primer 25% obtendremos que la masa de los meteoritos en ese corte es de 7.2 g, al cortarlo en el 50% quiere decir que el valor del peso que se encuentra exactamente a la mitad, es decir, en ese corte es de 32.6 g. Otra explicación que podríamos tener aqui es que el 50% de meteoritos no tienen un peso mayor a 32.6 g y asi sucesivamente con el último cuartil.

In [9]:
df_meteorites.describe()

                 id      mass (g)        reclat       reclong
count  45716.000000  4.558500e+04  38401.000000  38401.000000
mean   26889.735104  1.327808e+04    -39.122580     61.074319
std    16860.683030  5.749889e+05     46.378511     80.647298
min        1.000000  0.000000e+00    -87.366670   -165.433330
25%    12688.750000  7.200000e+00    -76.714240      0.000000
50%    24261.500000  3.260000e+01    -71.500000     35.666670
75%    40656.750000  2.026000e+02      0.000000    157.166670
max    57458.000000  6.000000e+07     81.166670    354.473330

- Podemos quitar la notación cientifica con la siguiente linea

In [10]:
pd.options.display.float_format = '{:,.1f}'.format

- Podemos usar describe  con la variable `include='all'` para ver el comportamiento de nuestras variables de tipo texto

    - El indice **unique** nos dice la variedad de nuestros datos 
    - La variable **freq** nos dice cual es el dato que más se repite

In [11]:
df_meteorites.describe(include='all')

                           name       id nametype  ...   reclat  reclong GeoLocation
count                     45716 45,716.0    45716  ... 38,401.0 38,401.0       38401
unique                    45716      NaN        2  ...      NaN      NaN       17100
top     Pecora Escarpment 01029      NaN    Valid  ...      NaN      NaN  (0.0, 0.0)
freq                          1      NaN    45641  ...      NaN      NaN        6214
mean                        NaN 26,889.7      NaN  ...    -39.1     61.1         NaN
std                         NaN 16,860.7      NaN  ...     46.4     80.6         NaN
min                         NaN      1.0      NaN  ...    -87.4   -165.4         NaN
25%                         NaN 12,688.8      NaN  ...    -76.7      0.0         NaN
50%                         NaN 24,261.5      NaN  ...    -71.5     35.7         NaN
75%                         NaN 40,656.8      NaN  ...      0.0    157.2         NaN
max                         NaN 57,458.0      NaN  ...     81.2    354.5         NaN

[11 rows x 10 columns]

- Si nosotros queremos ver de que están compuestas las categorias de nuestro DataFrame lo podemos hacer usando: `.info()`

In [12]:
df_meteorites.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass (g)     45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45425 non-null  object
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(3), int64(1), object(6)
memory usage: 3.5+ MB

- Con `dtypes`, se ve el tipo de datos

In [13]:
df_meteorites.dtypes

name            object
id               int64
nametype        object
recclass        object
mass (g)       float64
fall            object
year            object
reclat         float64
reclong        float64
GeoLocation     object
dtype: object

- Hay una nueva funcionalidad en pandas que nos permite convertir y encontrar el formato más adecuado para las variables, se llama `.convert_dtypes().dtypes`

In [14]:
df_meteorites.convert_dtypes().dtypes

name            string
id               Int64
nametype        string
recclass        string
mass (g)       Float64
fall            string
year            string
reclat         Float64
reclong        Float64
GeoLocation     string
dtype: object

### Estructuras de DataFrame en detalle
Diferentes variables que se pueden llegar a encontrar en un mismo DataFrame, variables **categoricas**, variables de tipo **tiempo**, de **texto**, **númericos** y dentro de estos están las float y las enteras. 

La ventaja de trabajar con variables categoricas es que se reduce el uso de memoria RAM y el espacio que ocupan los archivos 





- La variables `.nunique()` sirve para conocer la variedad de nuestros datos que componen el DF

En este ejemplo hay dos variables que llaman mucho la atención, son dos variables de tipo texto llamadas **nametype ** y **fall** y que según el comando `nunuque()` están compuestas de dos variedades.

In [15]:
df_meteorites.nunique()

name           45716
id             45716
nametype           2
recclass         466
mass (g)       12576
fall               2
year             266
reclat         12738
reclong        14640
GeoLocation    17100
dtype: int64

Al ver ambas columnas a más detalle, vemos que es una variable que define simplemente una categoria. 

Esto tiene por nombre **VARIABLES CATEGORICAS**

In [16]:
df_meteorites[['fall','nametype']]

        fall nametype
0       Fell    Valid
1       Fell    Valid
2       Fell    Valid
3       Fell    Valid
4       Fell    Valid
...      ...      ...
45711  Found    Valid
45712  Found    Valid
45713  Found    Valid
45714  Found    Valid
45715  Found    Valid

[45716 rows x 2 columns]


`.astype('category')` define una nueva variable en nuestrp DF

In [17]:
df_meteorites[['fall','nametype']].astype('category')

        fall nametype
0       Fell    Valid
1       Fell    Valid
2       Fell    Valid
3       Fell    Valid
4       Fell    Valid
...      ...      ...
45711  Found    Valid
45712  Found    Valid
45713  Found    Valid
45714  Found    Valid
45715  Found    Valid

[45716 rows x 2 columns]

Aseguramos que el cambio afecte al DataFrame, hacemos lo siguiente

In [18]:
df_meteorites[['fall','nametype']] = df_meteorites[['fall','nametype']].astype('category')

In [19]:
#vemos que el cambio se ha efectuado
df_meteorites.dtypes

name             object
id                int64
nametype       category
recclass         object
mass (g)        float64
fall           category
year             object
reclat          float64
reclong         float64
GeoLocation      object
dtype: object

- Podemo usar `unique()` para saber cuales son el tipo de categorias que contiene la columna (teniendo en caso que evidendeciamos esto). Encontramos la cántidad de objeto que contiene

In [20]:
df_meteorites['fall'].unique()

['Fell', 'Found']
Categories (2, object): ['Fell', 'Found']

- Con `.value_counts()` podemos saber la frecuencia de estás categorias o palabras

In [21]:
df_meteorites['fall'].value_counts()

Found    44609
Fell      1107
Name: fall, dtype: int64

- Otra forma de trabajar con variables categoricas es crear variables dummies `.get_dummies()`.

Convertir las variables de tipo texto a númerico al momento de realizar un analisis de datos, es una buena practica. Se tiene en cuenta que esto se hace directamente en el pd para que el cambio se vea aplicado

In [22]:
pd.get_dummies(df_meteorites['fall'])

       Fell  Found
0         1      0
1         1      0
2         1      0
3         1      0
4         1      0
...     ...    ...
45711     0      1
45712     0      1
45713     0      1
45714     0      1
45715     0      1

[45716 rows x 2 columns]

Se pueden crear nuevas variables, columnas; colocando el nombre de la columna dentro de un corchete, de la siguiente forma:

In [23]:
df_meteorites['ones'] = 1
df_meteorites

             name     id nametype  ... reclong             GeoLocation ones
0          Aachen      1    Valid  ...     6.1       (50.775, 6.08333)    1
1          Aarhus      2    Valid  ...    10.2    (56.18333, 10.23333)    1
2            Abee      6    Valid  ...  -113.0      (54.21667, -113.0)    1
3        Acapulco     10    Valid  ...   -99.9       (16.88333, -99.9)    1
4         Achiras    370    Valid  ...   -65.0     (-33.16667, -64.95)    1
...           ...    ...      ...  ...     ...                     ...  ...
45711  Zillah 002  31356    Valid  ...    17.0       (29.037, 17.0185)    1
45712      Zinder  30409    Valid  ...     9.0     (13.78333, 8.96667)    1
45713        Zlin  30410    Valid  ...    17.7       (49.25, 17.66667)    1
45714   Zubkovsky  31357    Valid  ...    41.5     (49.78917, 41.5046)    1
45715  Zulu Queen  30414    Valid  ...  -115.7  (33.98333, -115.68333)    1

[45716 rows x 11 columns]

Si se quiere quiere crear las columnas **fell** y **found** con la varibale dummies se hace de la siguiente forma:
  - Definimos nuestras dos variables dummies dentro de los corchetes para crear sus correspondiente columnas

In [24]:
df_meteorites[['fell','found']] = pd.get_dummies(df_meteorites['fall'])

In [25]:
df_meteorites

             name     id nametype  ... ones  fell found
0          Aachen      1    Valid  ...    1     1     0
1          Aarhus      2    Valid  ...    1     1     0
2            Abee      6    Valid  ...    1     1     0
3        Acapulco     10    Valid  ...    1     1     0
4         Achiras    370    Valid  ...    1     1     0
...           ...    ...      ...  ...  ...   ...   ...
45711  Zillah 002  31356    Valid  ...    1     0     1
45712      Zinder  30409    Valid  ...    1     0     1
45713        Zlin  30410    Valid  ...    1     0     1
45714   Zubkovsky  31357    Valid  ...    1     0     1
45715  Zulu Queen  30414    Valid  ...    1     0     1

[45716 rows x 13 columns]

#### Variables de tiempo

In [26]:
df_meteorites['year']

0        01/01/1880 12:00:00 AM
1        01/01/1951 12:00:00 AM
2        01/01/1952 12:00:00 AM
3        01/01/1976 12:00:00 AM
4        01/01/1902 12:00:00 AM
                  ...
45711    01/01/1990 12:00:00 AM
45712    01/01/1999 12:00:00 AM
45713    01/01/1939 12:00:00 AM
45714    01/01/2003 12:00:00 AM
45715    01/01/1976 12:00:00 AM
Name: year, Length: 45716, dtype: object

- Para transformar la variable a tipo tiempo (ya que se encuentra de tipo texto), utilizamos `pd.to_datetime()` dentro del parentesis colocamos la serie y se pueden agregar otros argumentos extras que permiten convertir de tipo texto a tiempo. la primera es usar el parámetro `errors = 'coerce'`, esto me permite, que cada vez que encuentre un formato que no corresponda al tiempo, simplemente genere una variable no númerica, así mismo definimos el formato `format = '%m/%d/%Y %H:%M:%S %p'` que compone nuestra fecha

In [27]:
pd.to_datetime(
df_meteorites['year'],
errors = 'coerce',
format = '%m/%d/%Y %H:%M:%S %p'
)

0       1880-01-01 12:00:00
1       1951-01-01 12:00:00
2       1952-01-01 12:00:00
3       1976-01-01 12:00:00
4       1902-01-01 12:00:00
                ...
45711   1990-01-01 12:00:00
45712   1999-01-01 12:00:00
45713   1939-01-01 12:00:00
45714   2003-01-01 12:00:00
45715   1976-01-01 12:00:00
Name: year, Length: 45716, dtype: datetime64[ns]

Para almacenar la variable dentro del DataFrame, cogemos la columna 'año' y la sobreescribimos con la celda anterior que se creo.

In [28]:
df_meteorites['year'] =  pd.to_datetime(
df_meteorites['year'],
errors = 'coerce',
format = '%m/%d/%Y %H:%M:%S %p'
)

Revisamos los cambiamos que se han realizado con respecto al cambio de tipo de las variables y las nuevas columnas que se han creado

In [29]:
df_meteorites.convert_dtypes().dtypes

name                   string
id                      Int64
nametype             category
recclass               string
mass (g)              Float64
fall                 category
year           datetime64[ns]
reclat                Float64
reclong               Float64
GeoLocation            string
ones                    Int64
fell                    UInt8
found                   UInt8
dtype: object

- Si se quiere renombrar el nombre de las columnas, se puede hacer utilizando  `.rename`, se crea dentro un diccionario que va a contener el nombre de la columna inicial y después el nombre de la columna que va a contener

Si se quiere guardar directamente este cambio directamente en el DataFrame, agregamos el parámetro `inplace=True `, significa que los cambios que realice, se han guardados directamente en el DataFrame

In [30]:
df_meteorites.rename(columns={'mass (g)':'mass'}, inplace=True)

In [31]:
df_meteorites

             name     id nametype  ... ones  fell found
0          Aachen      1    Valid  ...    1     1     0
1          Aarhus      2    Valid  ...    1     1     0
2            Abee      6    Valid  ...    1     1     0
3        Acapulco     10    Valid  ...    1     1     0
4         Achiras    370    Valid  ...    1     1     0
...           ...    ...      ...  ...  ...   ...   ...
45711  Zillah 002  31356    Valid  ...    1     0     1
45712      Zinder  30409    Valid  ...    1     0     1
45713        Zlin  30410    Valid  ...    1     0     1
45714   Zubkovsky  31357    Valid  ...    1     0     1
45715  Zulu Queen  30414    Valid  ...    1     0     1

[45716 rows x 13 columns]

- Una forma practica de obtener los nombres de las columnas es hacer`list(nom_df)`

In [32]:
list(df_meteorites)

['name',
 'id',
 'nametype',
 'recclass',
 'mass',
 'fall',
 'year',
 'reclat',
 'reclong',
 'GeoLocation',
 'ones',
 'fell',
 'found']

### Borrar Filas, Columnas y Copiar información

In [33]:
df_meteorites.head(5)
#Aquí estamos creando la columna de ejemplo para borrar
df_meteorites['ones'] = 1

Con `.drop()` Borramos. Se debe espexificar que se quiere borrar, si una columna o un indice, el '1' corresponde a columna. Utilizamos `inplace` para que actualice directamente el DataFrame y se hagan efectivos los datos.

In [34]:
df_meteorites.drop(['ones'], axis=1, inplace=True)

Cuando se hace `drop` de una lista, pandas reconoce que estoy borrando en el eje de las filas

In [35]:
df_meteorites.drop([0,2,4,6]).head(10)

                name   id nametype  ...           GeoLocation  fell found
1             Aarhus    2    Valid  ...  (56.18333, 10.23333)     1     0
3           Acapulco   10    Valid  ...     (16.88333, -99.9)     1     0
5           Adhi Kot  379    Valid  ...          (32.1, 71.8)     1     0
7               Agen  392    Valid  ...   (44.21667, 0.61667)     1     0
8             Aguada  398    Valid  ...    (-31.6, -65.23333)     1     0
9      Aguila Blanca  417    Valid  ...   (-30.86667, -64.55)     1     0
10  Aioun el Atrouss  423    Valid  ...  (16.39806, -9.57028)     1     0
11               Aïr  424    Valid  ...   (19.08333, 8.38333)     1     0
12   Aire-sur-la-Lys  425    Valid  ...   (50.66667, 2.33333)     1     0
13             Akaba  426    Valid  ...     (29.51667, 35.05)     1     0

[10 rows x 12 columns]

También se pueden especificar las variables que se quieran borrar y las columnas que quiero borrar, colocando en una lista el conjunto de elementos que se quieren borrar.

In [36]:
df_meteorites.drop(columns = ['id','recclass'],index=[0,2,4,6])

             name nametype     mass  ...             GeoLocation fell  found
1          Aarhus    Valid    720.0  ...    (56.18333, 10.23333)    1      0
3        Acapulco    Valid  1,914.0  ...       (16.88333, -99.9)    1      0
5        Adhi Kot    Valid  4,239.0  ...            (32.1, 71.8)    1      0
7            Agen    Valid 30,000.0  ...     (44.21667, 0.61667)    1      0
8          Aguada    Valid  1,620.0  ...      (-31.6, -65.23333)    1      0
...           ...      ...      ...  ...                     ...  ...    ...
45711  Zillah 002    Valid    172.0  ...       (29.037, 17.0185)    0      1
45712      Zinder    Valid     46.0  ...     (13.78333, 8.96667)    0      1
45713        Zlin    Valid      3.3  ...       (49.25, 17.66667)    0      1
45714   Zubkovsky    Valid  2,167.0  ...     (49.78917, 41.5046)    0      1
45715  Zulu Queen    Valid    200.0  ...  (33.98333, -115.68333)    0      1

[45712 rows x 10 columns]

Si nosotros queremos modificar un `DataFrame` de nuestra rutina de preporcesamiento, pero no queremos guardar los cambios directamente sobre él, sino que queremos guardar una copia, lo recomendable es utilizar el comando `.copy()`. 

Definimos un nuevo DataFrame que va hacer una copia del anterior y debemos especificar siempre que la copia es profunda `.copy(deep=True)`, porque normalmente cuando se copia un DataFrame en una variable, la variable no copia directamente la información si no lo que copia es la referencia a la memoria donde se están guardando los datos. 

Si hacemos:


```
df = df_meteorites
```
y modificamos el `df`, ese cambio también se verá reflejado en el `df_meteorites`, por esto, se debe tener cuidado al momento de hacer la copia.  

Cuando hacemos la copia, está se ve alterada (la copia); pero mi archivo original no.

In [37]:
df  = df_meteorites.copy(deep=True)
df.drop(['id'],axis=1,inplace=True)

Aquí se puede ver que no se vío afectada nuestra estructura original sino que la afectación fue directamente en la copia.

In [38]:
df_meteorites

             name     id nametype  ...             GeoLocation  fell found
0          Aachen      1    Valid  ...       (50.775, 6.08333)     1     0
1          Aarhus      2    Valid  ...    (56.18333, 10.23333)     1     0
2            Abee      6    Valid  ...      (54.21667, -113.0)     1     0
3        Acapulco     10    Valid  ...       (16.88333, -99.9)     1     0
4         Achiras    370    Valid  ...     (-33.16667, -64.95)     1     0
...           ...    ...      ...  ...                     ...   ...   ...
45711  Zillah 002  31356    Valid  ...       (29.037, 17.0185)     0     1
45712      Zinder  30409    Valid  ...     (13.78333, 8.96667)     0     1
45713        Zlin  30410    Valid  ...       (49.25, 17.66667)     0     1
45714   Zubkovsky  31357    Valid  ...     (49.78917, 41.5046)     0     1
45715  Zulu Queen  30414    Valid  ...  (33.98333, -115.68333)     0     1

[45716 rows x 12 columns]